#+TITLE: Herramientas CLI
#+AUTHOR: Miguel Angel Escalante Serrato
#+EMAIL:  miguel.escalante@itam.mx
#+DATE: 26-Oct-2020
#+LANGUAGE:  es
#+OPTIONS: num:nil toc:nil
#+REVEAL_THEME: moon
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_TRANS: cube
#+REVEAL_SLIDE_NUMBER: t
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Estadística Computacional">

*** For.
#+begin_src shell
awk 'BEGIN { for (i=1; i<=10; i++) print "El cuadrado de ", i, "es",i*i;}'
#+end_src

#+RESULTS:
| El | cuadrado | de |  1 | es |   1 |
| El | cuadrado | de |  2 | es |   4 |
| El | cuadrado | de |  3 | es |   9 |
| El | cuadrado | de |  4 | es |  16 |
| El | cuadrado | de |  5 | es |  25 |
| El | cuadrado | de |  6 | es |  36 |
| El | cuadrado | de |  7 | es |  49 |
| El | cuadrado | de |  8 | es |  64 |
| El | cuadrado | de |  9 | es |  81 |
| El | cuadrado | de | 10 | es | 100 |

